Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationOutOfSizeCondition Property
 The fabrication part size is not within the correct size range for the service button condition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationOutOfSizeCondition { get; }
Visual Basic
Public Shared ReadOnly Property FabricationOutOfSizeCondition As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationOutOfSizeCondition {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace